# DataFrames

In [5]:
import pandas as pd
import numpy as np

In [6]:
from numpy.random import randn
np.random.seed(55)

In [7]:
dataframe = pd.DataFrame(randn(4,5),index=['P','Q','R','S'],columns=['A','B','C','D','E'])

In [8]:
dataframe

          A         B         C         D         E
P -1.623731 -0.101784 -1.809791  0.262654  0.259953
Q -0.381086 -0.002290  0.341615  0.897572 -0.361100
R  1.656445 -1.189009  1.666429 -2.003439 -0.477873
S  1.368799  0.258169  0.702352  0.888382  0.722220

## Indexing and Selectionin dataframes

Let's learn the various methods to select data from a DataFrame

In [9]:
dataframe['A']

P   -1.623731
Q   -0.381086
R    1.656445
S    1.368799
Name: A, dtype: float64

In [10]:
# Passing a list of column names
dataframe[['A','B']]

          A         B
P -1.623731 -0.101784
Q -0.381086 -0.002290
R  1.656445 -1.189009
S  1.368799  0.258169

DataFrame Columns are just Series

In [12]:
type(dataframe['A'])

pandas.core.series.Series

**Creating a new column:**

In [14]:
dataframe['F'] = dataframe['A'] + dataframe['B']

In [15]:
dataframe

          A         B         C         D         E         F
P -1.623731 -0.101784 -1.809791  0.262654  0.259953 -1.725515
Q -0.381086 -0.002290  0.341615  0.897572 -0.361100 -0.383376
R  1.656445 -1.189009  1.666429 -2.003439 -0.477873  0.467436
S  1.368799  0.258169  0.702352  0.888382  0.722220  1.626967

** Removing Columns**

In [16]:
dataframe.drop('F',axis=1)

          A         B         C         D         E
P -1.623731 -0.101784 -1.809791  0.262654  0.259953
Q -0.381086 -0.002290  0.341615  0.897572 -0.361100
R  1.656445 -1.189009  1.666429 -2.003439 -0.477873
S  1.368799  0.258169  0.702352  0.888382  0.722220

In [17]:
dataframe

          A         B         C         D         E         F
P -1.623731 -0.101784 -1.809791  0.262654  0.259953 -1.725515
Q -0.381086 -0.002290  0.341615  0.897572 -0.361100 -0.383376
R  1.656445 -1.189009  1.666429 -2.003439 -0.477873  0.467436
S  1.368799  0.258169  0.702352  0.888382  0.722220  1.626967

In [194]:
# Not inplace unless specified!
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [18]:
dataframe.drop('F',axis=1,inplace=True)

In [19]:
dataframe

          A         B         C         D         E
P -1.623731 -0.101784 -1.809791  0.262654  0.259953
Q -0.381086 -0.002290  0.341615  0.897572 -0.361100
R  1.656445 -1.189009  1.666429 -2.003439 -0.477873
S  1.368799  0.258169  0.702352  0.888382  0.722220

Can also drop rows this way:

In [ ]:
dataframe.drop('P',axis=0,inplace=True)

In [24]:
dataframe.drop('P',axis=0,inplace=True)
dataframe

          A         B         C         D         E
Q -0.381086 -0.002290  0.341615  0.897572 -0.361100
R  1.656445 -1.189009  1.666429 -2.003439 -0.477873
S  1.368799  0.258169  0.702352  0.888382  0.722220

** Selecting Rows**

In [32]:
dataframe.loc['Q']

A   -0.381086
B   -0.002290
C    0.341615
D    0.897572
E   -0.361100
Name: Q, dtype: float64

Or select based off of position instead of label

In [30]:
dataframe.iloc[0]

A   -0.381086
B   -0.002290
C    0.341615
D    0.897572
E   -0.361100
Name: Q, dtype: float64

In [33]:
# Select all the rows and columns
dataframe.iloc[:]

          A         B         C         D         E
Q -0.381086 -0.002290  0.341615  0.897572 -0.361100
R  1.656445 -1.189009  1.666429 -2.003439 -0.477873
S  1.368799  0.258169  0.702352  0.888382  0.722220

In [38]:
#Skip the last column from the dataframe
dataframe.iloc[:,:-1]

          A         B         C         D
Q -0.381086 -0.002290  0.341615  0.897572
R  1.656445 -1.189009  1.666429 -2.003439
S  1.368799  0.258169  0.702352  0.888382

In [40]:
#Select subset Q and R rows along with B and C columns
dataframe.iloc[:2,1:3]

          B         C
Q -0.002290  0.341615
R -1.189009  1.666429

In [41]:
# Select subset of rows and column using dataframe.loc
dataframe.loc['Q','A']

-0.3810863829200849

In [42]:
dataframe
dataframe.loc[['Q','R'],['B','C']]

          B         C
Q -0.002290  0.341615
R -1.189009  1.666429

### Conditional Selection

An important feature of pandas is conditional selection using bracket notation, very similar to numpy:

In [43]:
dataframe

          A         B         C         D         E
Q -0.381086 -0.002290  0.341615  0.897572 -0.361100
R  1.656445 -1.189009  1.666429 -2.003439 -0.477873
S  1.368799  0.258169  0.702352  0.888382  0.722220

In [44]:
dataframe>0

       A      B     C      D      E
Q  False  False  True   True  False
R   True  False  True  False  False
S   True   True  True   True   True

In [46]:
#return the values where the value> 0 else returns NaN
dataframe[dataframe>0]

          A         B         C         D        E
Q       NaN       NaN  0.341615  0.897572      NaN
R  1.656445       NaN  1.666429       NaN      NaN
S  1.368799  0.258169  0.702352  0.888382  0.72222

In [47]:
#Returns the complete rows and columns where the value of columns A > 0
dataframe[dataframe['A']>0]

          A         B         C         D         E
R  1.656445 -1.189009  1.666429 -2.003439 -0.477873
S  1.368799  0.258169  0.702352  0.888382  0.722220

For multiple conditions we can use | and & with parenthesis:

In [51]:
dataframe[(dataframe['A']>0) & (dataframe['B'] > 0)]

          A         B         C         D        E
S  1.368799  0.258169  0.702352  0.888382  0.72222

In [52]:
dataframe

          A         B         C         D         E
Q -0.381086 -0.002290  0.341615  0.897572 -0.361100
R  1.656445 -1.189009  1.666429 -2.003439 -0.477873
S  1.368799  0.258169  0.702352  0.888382  0.722220

In [53]:
# reset_index() reset to default 0,1...n index
dataframe.reset_index()

  index         A         B         C         D         E
0     Q -0.381086 -0.002290  0.341615  0.897572 -0.361100
1     R  1.656445 -1.189009  1.666429 -2.003439 -0.477873
2     S  1.368799  0.258169  0.702352  0.888382  0.722220